{
  "_name_or_path": "medicalai/ClinicalBERT",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-age",
    "1": "I-age",
    "2": "B-allergy_name",
    "3": "I-allergy_name",
    "4": "B-bmi",
    "5": "I-bmi",
    "6": "B-cancer",
    "7": "I-cancer",
    "8": "B-chronic_disease",
    "9": "I-chronic_disease",
    "10": "B-clinical_variable",
    "11": "I-clinical_variable",
    "12": "B-contraception_consent",
    "13": "I-contraception_consent",
    "14": "B-ethnicity",
    "15": "I-ethnicity",
    "16": "B-gender",
    "17": "I-gender",
    "18": "B-language_fluency",
    "19": "I-language_fluency",
    "20": "B-lower_bound",
    "21": "I-lower_bound",
    "22": "B-pregnancy",
    "23": "I-pregnancy",
    "24": "B-technology_access",
    "25": "I-technology_access",
    "26": "B-treatment",
    "27": "I-treatment",
    "28": "B-upper_bound",
    "29": "I-upper_bound",
    "30": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-age": 0,
    "B-allergy_name": 2,
    "B-bmi": 4,
    "B-cancer": 6,
    "B-chronic_disease": 8,
    "B-clinical_variable": 10,
    "B-contraception_consent": 12,
    "B-ethnicity": 14,
    "B-gender": 16,
    "B-language_fluency": 18,
    "B-lower_bound": 20,
    "B-pregnancy": 22,
    "B-technology_access": 24,
    "B-treatment": 26,
    "B-upper_bound": 28,
    "I-age": 1,
    "I-allergy_name": 3,
    "I-bmi": 5,
    "I-cancer": 7,
    "I-chronic_disease": 9,
    "I-clinical_variable": 11,
    "I-contraception_consent": 13,
    "I-ethnicity": 15,
    "I-gender": 17,
    "I-language_fluency": 19,
    "I-lower_bound": 21,
    "I-pregnancy": 23,
    "I-technology_access": 25,
    "I-treatment": 27,
    "I-upper_bound": 29,
    "O": 30
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 119547
}
